Infineon/AURIX_code_examples/code_examples/iLLD_TC37x_ADS_SCR_Blinky_LED_LK_1/Libraries/Infra/Ssw/TC37A/Tricore/Ifx_Ssw_Infra.h
/** \brief De-initialize the C/Cpp runtime environment */
extern void Ifx_Ssw_doCppExit(int status);

/** \brief Returns the system timer frequency.
 * \return the system timer frequency in Hz.
 */
extern float          Ifx_Ssw_getStmFrequency(void);

/** \brief SCUWDT API to service CPU Watchdog functionality.
 *
 *   This API will service Watchdog functionality corresponding to CPU WDT Hardware module.
 *   User need to use this API call periodically. This API results in reloading of the Watchdog Timer.
 *   User need to have the password stored locally in the caller function, (use Ifx_Ssw_getCpuWatchdogPassword).
 * \param password Existing (Application specific) password for the Watchdog module.
 * \param watchdog pointer to the watchdog register map of CPU WDT hardware instance.
 * \return None
 */
extern void Ifx_Ssw_serviceCpuWatchdog(Ifx_SCU_WDTCPU *watchdog, unsigned short password);

/** \brief SCUWDT API to service Safety Watchdog functionality.
 *
 * This API will service Watchdog functionality corresponding to Safety WDT Hardware module.
 * User need to use this API call periodically. This API results in reloading of the Watchdog Timer.
 * User need to have the password stored locally in the caller function, (use Ifx_Ssw_getSafetyWatchdogPassword).
 * \param password Existing (Application specific) password for the Watchdog module.
 * \return None
 */
extern void Ifx_Ssw_serviceSafetyWatchdog(unsigned short password);

/* Hook Functions */
extern IFX_SSW_WEAK void hardware_init_hook(void);
extern IFX_SSW_WEAK void software_init_hook(void);

/*Endinit Functions*/
IFX_SSW_INLINE unsigned short Ifx_Ssw_getGlobalSafetyEndinitPasswordInline(void)
{
    /* Read Password from CON0 register
     * !!! NOTE: !!! when read bottom six bit of password are inverted so we have
     * to toggle them before returning password */

    unsigned short password = (unsigned short)MODULE_SCU.SEICON0.B.EPW ^ IFX_SSW_WDT_PASSWORD_INVERT_MSK;
    return password;
}


IFX_SSW_INLINE void Ifx_Ssw_clearGlobalSafetyEndinitInline(unsigned short password)
{
    /* Clear EndInit Watch-dog*/
    MODULE_SCU.SEICON0.U = IFX_SSW_SEICON_REL_VAL_MSK | ((unsigned int)password << IFX_SCU_SEICON0_EPW_OFF);

    /* Read back of the register is mandatory to ensure the register update */
    MODULE_SCU.SEICON0.U;
}


IFX_SSW_INLINE void Ifx_Ssw_setGlobalSafetyEndinitInline(unsigned short password)
{
    /* Set EndInit Watch-dog*/
    MODULE_SCU.SEICON0.U = IFX_SSW_SEICON_REL_VAL_MSK | \
                           ((unsigned int)password << IFX_SCU_SEICON0_EPW_OFF) | \
                           ((unsigned int)1 << IFX_SCU_SEICON0_ENDINIT_OFF);

    /* Read back of the register is mandatory to ensure the register update  */
    MODULE_SCU.SEICON0.U;
}


IFX_SSW_INLINE unsigned short Ifx_Ssw_getCpuWatchdogPasswordInline(Ifx_SCU_WDTCPU *watchdog)
{
    unsigned short password;

    /* Read Password from CON0 register
     * !!! NOTE: !!! when read bottom six bit of password are inverted so we have
     * to toggle them before returning password */
    password  = watchdog->CON0.B.PW;
    password ^= IFX_SSW_WDT_PASSWORD_INVERT_MSK;

    return password;
}


IFX_SSW_INLINE unsigned short Ifx_Ssw_getSafetyWatchdogPasswordInline(void)
{
    unsigned short password;
    Ifx_SCU_WDTS  *watchdog;
    watchdog = &MODULE_SCU.WDTS;
    /* Read Password from Safety WDT CON0 register
     * !!! NOTE: !!! when read bottom six bit of password are inverted so we have
     * to toggle them before returning password */
    password  = watchdog->CON0.B.PW;
    password ^= IFX_SSW_WDT_PASSWORD_INVERT_MSK;

    return password;
}


IFX_SSW_INLINE void Ifx_Ssw_clearCpuEndinitInline(Ifx_SCU_WDTCPU *watchdog, unsigned short password)
{
    if (watchdog->CON0.B.LCK)
    {
        /* see Table 1 (Password Access Bit Pattern Requirements) */
        watchdog->CON0.U = ((unsigned int)1 << IFX_SCU_WDTCPU_CON0_ENDINIT_OFF) |
                           ((unsigned int)0 << IFX_SCU_WDTCPU_CON0_LCK_OFF) |
                           ((unsigned int)password << IFX_SCU_WDTCPU_CON0_PW_OFF) |
                           ((unsigned int)watchdog->CON0.B.REL << IFX_SCU_WDTCPU_CON0_REL_OFF);
    }

    /* Clear ENDINT and set LCK bit in Config_0 register */
    watchdog->CON0.U = ((unsigned int)0 << IFX_SCU_WDTCPU_CON0_ENDINIT_OFF) |
                       ((unsigned int)1 << IFX_SCU_WDTCPU_CON0_LCK_OFF) |
                       ((unsigned int)password << IFX_SCU_WDTCPU_CON0_PW_OFF) |
                       ((unsigned int)watchdog->CON0.B.REL << IFX_SCU_WDTCPU_CON0_REL_OFF);

    /* Read back of the register is mandatory to ensure the register update  */
    watchdog->CON0.U;
}


IFX_SSW_INLINE void Ifx_Ssw_clearSafetyEndinitInline(unsigned short password)
{
    if (SCU_WDTS_CON0.B.LCK)
    {
        /* see Table 1 (Password Access Bit Pattern Requirements) */
        SCU_WDTS_CON0.U = ((unsigned int)1 << IFX_SCU_WDTS_CON0_ENDINIT_OFF) |
                          ((unsigned int)0 << IFX_SCU_WDTS_CON0_LCK_OFF) |
                          ((unsigned int)password << IFX_SCU_WDTS_CON0_PW_OFF) |
                          ((unsigned int)SCU_WDTS_CON0.B.REL << IFX_SCU_WDTS_CON0_REL_OFF);
    }

    /* Clear ENDINT and set LCK bit in Config_0 register */
    SCU_WDTS_CON0.U = ((unsigned int)0 << IFX_SCU_WDTS_CON0_ENDINIT_OFF) |
                      ((unsigned int)1 << IFX_SCU_WDTS_CON0_LCK_OFF) |
                      ((unsigned int)password << IFX_SCU_WDTS_CON0_PW_OFF) |
                      ((unsigned int)SCU_WDTS_CON0.B.REL << IFX_SCU_WDTS_CON0_REL_OFF);

    /* Read back of the register is mandatory to ensure the register update  */
    SCU_WDTS_CON0.U;
}


IFX_SSW_INLINE void Ifx_Ssw_setCpuEndinitInline(Ifx_SCU_WDTCPU *watchdog, unsigned short password)
{
    if (watchdog->CON0.B.LCK)
    {
        /* see Table 1 (Pass.word Access Bit Pattern Requirements) */
        watchdog->CON0.U = ((unsigned int)1 << IFX_SCU_WDTCPU_CON0_ENDINIT_OFF) |
                           ((unsigned int)0 << IFX_SCU_WDTCPU_CON0_LCK_OFF) |
                           ((unsigned int)password << IFX_SCU_WDTCPU_CON0_PW_OFF) |
                           ((unsigned int)watchdog->CON0.B.REL << IFX_SCU_WDTCPU_CON0_REL_OFF);
    }

    /* Set ENDINT and set LCK bit in Config_0 register */
    watchdog->CON0.U = ((unsigned int)1 << IFX_SCU_WDTCPU_CON0_ENDINIT_OFF) |
                       ((unsigned int)1 << IFX_SCU_WDTCPU_CON0_LCK_OFF) |
                       ((unsigned int)password << IFX_SCU_WDTCPU_CON0_PW_OFF) |
                       ((unsigned int)watchdog->CON0.B.REL << IFX_SCU_WDTCPU_CON0_REL_OFF);

    /* Read back of the register is mandatory to ensure the register update  */
    watchdog->CON0.U;
}


IFX_SSW_INLINE void Ifx_Ssw_setSafetyEndinitInline(unsigned short password)
{
    if (SCU_WDTS_CON0.B.LCK)
    {
        /* see Table 1 (Password Access Bit Pattern Requirements) */
        SCU_WDTS_CON0.U = ((unsigned int)1 << IFX_SCU_WDTS_CON0_ENDINIT_OFF) |
                          ((unsigned int)0 << IFX_SCU_WDTS_CON0_LCK_OFF) |
                          ((unsigned int)password << IFX_SCU_WDTS_CON0_PW_OFF) |
                          ((unsigned int)SCU_WDTS_CON0.B.REL << IFX_SCU_WDTS_CON0_REL_OFF);
    }

    /* Set ENDINT and set LCK bit in Config_0 register */
    SCU_WDTS_CON0.U = ((unsigned int)1 << IFX_SCU_WDTS_CON0_ENDINIT_OFF) |
                      ((unsigned int)1 << IFX_SCU_WDTS_CON0_LCK_OFF) |
                      ((unsigned int)password << IFX_SCU_WDTS_CON0_PW_OFF) |
                      ((unsigned int)SCU_WDTS_CON0.B.REL << IFX_SCU_WDTS_CON0_REL_OFF);

    /* Read back of the register is mandatory to ensure the register update  */
    SCU_WDTS_CON0.U;
}

/* Check if Cold PowerOn Reset */

IFX_SSW_INLINE char Ifx_Ssw_isColdPoweronReset(void)
{
    return (char)((SCU_RSTSTAT.U & IFX_SSW_COLD_POWERONRESET_MASK) > 0);
}

